import React, { useContext } from "react";
import { ThemeContext } from "../../context/ThemeContext";
import "./text.css";

function Text() {
  const { isLightTheme, light, dark } = useContext(ThemeContext); // GLOBAL DATA
  const theme = isLightTheme ? light : dark;

  return (
    <div style={{ color: theme.syntax, background: theme.bg }} className="text">
      <p>
        ქ. ქუთაისის აკაკი წერეთლის სახელობის N 1 საჯარო სკოლის გაზეთი ,,
        ელიონი'' (2002- 2009 წ.წ.) გაზეთის დევიზი: ,,ცა- ფირუზ, ხმელეთ-ზურმუხტო,
        ჩემო სამშობლო მხარეო!''- აკაკი რედაქტორი ლალი მიქაძე, ქართული ენისა და
        ლიტერატურის მასწავლებელი. გაზეთი დაარსდა 2002 წ. იანვარში. 7 წლის
        განმავლობაში გამოვიდა მისი 23 ნომერი. მასში ასახული იყო მოსწავლეთა
        სულისკვეთება, შემოქმედებითი ნიჭი, წარმოჩინდა აქტუალური საკითხები,
        ,,ელიონი'' იყო სკოლის ყოველდღიური ცხოვრების მემატიანე.
      </p>

      <p>
        გაზეთს ჰქონდა მუდმივი რუბრიკები: მამულიშვილნი კლასიკური გიმნაზიიდან;
        წარმატებულნი; წამი, ქცეული მარადისობად( სკოლის ფოტომატიანე); როცა სულში
        ხელოვნების ნაპერწკალი კიაფობს(მოსწავლეთა შემოქმედება); კონკურსი
        ,,გონებანი გონიერსა'' უჩინართა ღვაწლი; დიდი ცხოვრების დასაწყისი. ტირაჟი
        ---1000. 2015 წ. მაისში გამოვიდა სკოლის 185 წლის საიუბილეო სპეცილური
        ნომერი- ჟურნალი . ტირაჟი - 500.
      </p>
    </div>
  );
}

export default Text;
